#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖Success! The configuration is valid.


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Refreshing Terraform state in-memory prior to plan...
The refreshed state will be used to calculate this plan, but will not be
persisted to local or remote state storage.

random_string.name: Refreshing state... [id=quwgjzofze]
random_string.password: Refreshing state... [id=RrKHMWOg4yvXs4S4De3T]
random_string.suffix: Refreshing state... [id=v8cgh]
module.server_mig.data.google_compute_zones.available: Refreshing state... [id=projects/ucontex-app/regions/us-central1]
module.client_mig.data.google_compute_zones.available: Refreshing state... [id=projects/ucontex-app/regions/us-central1]
data.google_compute_image.hashistack: Refreshing state... [id=projects/ucontex-app/global/images/hashistack]
data.google_compute_zones.available: Refreshing state... [id=projects/ucontex-app/regions/us-central1]
google_compute_target_pool.server: Refreshing state... [id=projects/ucontex-app/regions/us-central1/targetPools/server-v8cgh]
module.vpc_network.google_compute_network.vpc: Refreshing state... [id=projects/ucontex-app/global/networks/staging-v8cgh-network]
google_compute_target_pool.client: Refreshing state... [id=projects/ucontex-app/regions/us-central1/targetPools/client-v8cgh]
module.server_instance_template.data.google_compute_image.image: Refreshing state... [id=projects/ucontex-app/global/images/hashistack]
module.client_instance_template.data.google_compute_image.image_family: Refreshing state... [id=projects/centos-cloud/global/images/centos-6-v20201014]
module.client_instance_template.data.google_compute_image.image: Refreshing state... [id=projects/ucontex-app/global/images/hashistack]
module.server_instance_template.data.google_compute_image.image_family: Refreshing state... [id=projects/centos-cloud/global/images/centos-6-v20201014]
module.vpc_network.google_compute_router.vpc_router: Refreshing state... [id=projects/ucontex-app/regions/us-central1/routers/staging-v8cgh-router]
google_compute_firewall.vault-http: Refreshing state... [id=projects/ucontex-app/global/firewalls/vault-http]
google_compute_firewall.fabio-lb-http: Refreshing state... [id=projects/ucontex-app/global/firewalls/fabio-lb-http]
google_compute_firewall.allow-ingress-from-iap: Refreshing state... [id=projects/ucontex-app/global/firewalls/allow-ingress-from-iap]
module.vpc_network.module.network_firewall.google_compute_firewall.public_allow_all_inbound: Refreshing state... [id=projects/ucontex-app/global/firewalls/staging-v8cgh-public-allow-ingress]
google_compute_firewall.nomad-http: Refreshing state... [id=projects/ucontex-app/global/firewalls/nomad-http]
google_compute_firewall.services_endpoint: Refreshing state... [id=projects/ucontex-app/global/firewalls/external]
google_compute_firewall.internal: Refreshing state... [id=projects/ucontex-app/global/firewalls/internal]
google_compute_firewall.consul-http: Refreshing state... [id=projects/ucontex-app/global/firewalls/consul-http]
module.vpc_network.google_compute_subnetwork.vpc_subnetwork_public: Refreshing state... [id=projects/ucontex-app/regions/us-central1/subnetworks/staging-v8cgh-subnetwork-public]
module.vpc_network.module.network_firewall.google_compute_firewall.private_allow_restricted_network_inbound: Refreshing state... [id=projects/ucontex-app/global/firewalls/staging-v8cgh-allow-restricted-inbound]
module.vpc_network.google_compute_subnetwork.vpc_subnetwork_private: Refreshing state... [id=projects/ucontex-app/regions/us-central1/subnetworks/staging-v8cgh-subnetwork-private]
module.vpc_network.module.network_firewall.data.google_compute_subnetwork.private_subnetwork: Refreshing state... [id=projects/ucontex-app/regions/us-central1/subnetworks/staging-v8cgh-subnetwork-private]
module.client_instance_template.google_compute_instance_template.tpl: Refreshing state... [id=projects/ucontex-app/global/instanceTemplates/nomad-client-template-staging-20201102204716823800000002]
module.vpc_network.module.network_firewall.data.google_compute_subnetwork.public_subnetwork: Refreshing state... [id=projects/ucontex-app/regions/us-central1/subnetworks/staging-v8cgh-subnetwork-public]
module.vpc_network.google_compute_router_nat.vpc_nat: Refreshing state... [id=ucontex-app/us-central1/staging-v8cgh-router/staging-v8cgh-nat]
module.bastion_host.google_compute_instance.bastion_host: Refreshing state... [id=projects/ucontex-app/zones/us-central1-a/instances/bastion-host-staging-v8cgh]
module.server_instance_template.google_compute_instance_template.tpl: Refreshing state... [id=projects/ucontex-app/global/instanceTemplates/nomad-server-template-staging-20201102204716810800000001]
module.client_mig.google_compute_region_instance_group_manager.mig: Refreshing state... [id=projects/ucontex-app/regions/us-central1/instanceGroupManagers/client-v8cgh-mig]
module.server_mig.google_compute_region_instance_group_manager.mig: Refreshing state... [id=projects/ucontex-app/regions/us-central1/instanceGroupManagers/server-v8cgh-mig]
module.vpc_network.module.network_firewall.google_compute_firewall.private_allow_all_network_inbound: Refreshing state... [id=projects/ucontex-app/global/firewalls/staging-v8cgh-private-allow-ingress]

------------------------------------------------------------------------

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # google_compute_firewall.allow_ssh_office will be created
  + resource "google_compute_firewall" "allow_ssh_office" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "allow-ssh-office"
      + network            = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/networks/staging-v8cgh-network"
      + priority           = 1000
      + project            = (known after apply)
      + self_link          = (known after apply)
      + source_ranges      = (known after apply)
      + target_tags        = [
          + "allow-ssh",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # google_compute_firewall.services_endpoint will be updated in-place
  ~ resource "google_compute_firewall" "services_endpoint" {
        creation_timestamp      = "2020-11-02T12:46:54.818-08:00"
        destination_ranges      = []
        direction               = "INGRESS"
        disabled                = false
        id                      = "projects/ucontex-app/global/firewalls/external"
        name                    = "external"
        network                 = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/networks/staging-v8cgh-network"
        priority                = 1000
        project                 = "ucontex-app"
        self_link               = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/firewalls/external"
        source_ranges           = [
            "0.0.0.0/0",
        ]
        source_service_accounts = []
        source_tags             = []
        target_service_accounts = []
        target_tags             = []

      - allow {
          - ports    = [
              - "8080",
              - "22",
            ] -> null
          - protocol = "tcp" -> null
        }
      + allow {
          + ports    = [
              + "8080",
            ]
          + protocol = "tcp"
        }
    }

  # module.client_instance_template.google_compute_instance_template.tpl must be replaced
+/- resource "google_compute_instance_template" "tpl" {
        can_ip_forward          = false
      ~ id                      = "projects/ucontex-app/global/instanceTemplates/nomad-client-template-staging-20201102204716823800000002" -> (known after apply)
        machine_type            = "n1-standard-1"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "8lD3JF2csPI=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            #!/bin/bash
            
            set -xe
            
            PUBLIC_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/access-configs/0/external-ip -H "Metadata-Flavor:Google")
            PRIVATE_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/ip -H "Metadata-Flavor:Google")
            export VAULT_TOKEN=vault
            export VAULT_ADDR="http://localhost:8200"
            
            function configConsul() {
            	(
            		cat <<-EOF
            			datacenter = "us-central1"
            			data_dir   = "/opt/consul/data"
            			log_level  = "DEBUG"
            
            			bind_addr          = "0.0.0.0"
            			advertise_addr     = "$PRIVATE_IP"
            			advertise_addr_wan = "$PRIVATE_IP"
            
            			bootstrap_expect   = 1
            			client_addr = "0.0.0.0"
            			server      = true
            			ui          = true
            
            			retry_join = [
            			"provider=gce project_name=ucontex-app tag_value=autojoin"
            			]
            
            			raft_protocol = 3
            
            			autopilot {
            			cleanup_dead_servers      = true
            			last_contact_threshold    = "200ms"
            			max_trailing_logs         = 250
            			server_stabilization_time = "10s"
            			}
            
            			connect {
            			enabled = true
            			}
            
            			ports {}
            		EOF
            	) | sudo tee /etc/consul.d/consul.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=consul agent
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/consul agent -config-dir=/etc/consul.d
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/consul.service
            
            	sudo systemctl enable consul
            	sudo systemctl start consul
            }
            
            function configVault() {
            	(
            		cat <<-EOF
            			[Unit]
            			Description=vault
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/vault server -dev -dev-listen-address="0.0.0.0:8200" -dev-root-token-id="vault"
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/vault.service
            
            	sudo systemctl enable vault
            	sudo systemctl start vault
            
            	# vault policy write rabbit /vagrant/vault/rabbit-policy.hcl
            	# vault policy write nomad-server /vagrant/vault/nomad-server-policy.hcl
            	# vault write auth/token/roles/nomad-cluster @/vagrant/vault/nomad-cluster-role.json
            
            	vault_token=$(vault token create -policy nomad-server -period 72h -orphan -field=token)
            
            	# domain="mshome.net"
            	# vault secrets enable pki
            	# vault secrets tune -max-lease-ttl=87600h pki
            
            	# vault write -field=certificate pki/root/generate/internal common_name="$domain" ttl=87600h \
            	#     > /vagrant/vault/mshome.crt
            
            	# vault write pki/config/urls \
            	#     issuing_certificates="$VAULT_ADDR/v1/pki/ca" \
            	#     crl_distribution_points="$VAULT_ADDR/v1/pki/crl"
            
            	# vault write pki/roles/rabbit \
            	#     allowed_domains="$domain" \
            	#     allow_subdomains=true \
            	#     generate_lease=true \
            	#     max_ttl="720h"
            }
            
            function configNomad() {
            	(
            		cat <<-EOF
            			data_dir   = "/opt/nomad/data"
            			datacenter = "us-central1"
            			region     = "us-central1"
            
            			bind_addr = "0.0.0.0"
            			log_level = "DEBUG"
            
            			advertise {
            			http = "$PRIVATE_IP"
            			rpc  = "$PRIVATE_IP"
            			serf = "$PRIVATE_IP"
            			}
            
            			server {
            			enabled          = true
            			bootstrap_expect = "1"
            			}
            
            			client {
            			enabled       = true
            			network_speed = 10
            			}
            
            			consul {
            			address          = "127.0.0.1:8500"
            			auto_advertise   = true
            			server_auto_join = true
            			client_auto_join = true
            			}
            
            			vault {
            			enabled          = true
            			address          = "$VAULT_ADDR"
            			task_token_ttl   = "1h"
            			create_from_role = "nomad-cluster"
            			token            = "$vault_token"
            			}
          - 
            		EOF
            	) | sudo tee /etc/nomad.d/nomad.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=Nomad
            			Documentation=https://nomadproject.io/docs/
            			Wants=network-online.target
            			After=network-online.target
            
            			[Service]
            			ExecReload=/bin/kill -HUP $MAINPID
            			ExecStart=/usr/local/bin/nomad agent -config /etc/nomad.d
            			KillMode=process
            			KillSignal=SIGINT
            			LimitNOFILE=infinity
            			LimitNPROC=infinity
            			Restart=on-failure
            			RestartSec=2
            			StartLimitBurst=3
            			StartLimitIntervalSec=10
            			TasksMax=infinity
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/nomad.service
            
            	sudo systemctl enable nomad
            	sudo systemctl start nomad
            }
            
          - function run() {
          - 	# configure consul server
          - 	configConsul
          + # configure consul server
          + configConsul
            
          - 	# # configure vault server
          - 	configVault
          + # # configure vault server
          + configVault
            
          - 	sleep 5
          + # configure nomad server
          + configNomad
            
          - 	# configure nomad server
          - 	configNomad
          - 
          - 	sleep 5
          - }
          - 
          - # run setup instructions
          - run
            sudo systemctl daemon-reload
        EOT
      ~ name                    = "nomad-client-template-staging-20201102204716823800000002" -> (known after apply)
        name_prefix             = "nomad-client-template-staging-"
        project                 = "ucontex-app"
        region                  = "us-central1"
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/ucontex-app/global/instanceTemplates/nomad-client-template-staging-20201102204716823800000002" -> (known after apply)
      ~ tags                    = [ # forces replacement
          + "allow-ssh",
            "autojoin",
        ]
      + tags_fingerprint        = (known after apply)

      ~ disk {
            auto_delete  = true
            boot         = true
          ~ device_name  = "persistent-disk-0" -> (known after apply)
            disk_size_gb = 50
            disk_type    = "pd-standard"
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          ~ source_image = "projects/ucontex-app/global/images/hashistack" -> "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/images/hashistack"
          ~ type         = "PERSISTENT" -> (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/networks/staging-v8cgh-network"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/subnetworks/staging-v8cgh-subnetwork-public"
          ~ subnetwork_project = "ucontex-app" -> (known after apply)

          ~ access_config {
              + nat_ip                 = (known after apply)
              ~ network_tier           = "PREMIUM" -> (known after apply)
              + public_ptr_domain_name = (known after apply)
            }
        }

      ~ scheduling {
            automatic_restart   = true
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
            preemptible         = false
        }

      ~ service_account {
            email  = "terraform@ucontex-app.iam.gserviceaccount.com"
          - scopes = [] -> null
        }
    }

  # module.client_mig.google_compute_region_instance_group_manager.mig will be updated in-place
  ~ resource "google_compute_region_instance_group_manager" "mig" {
        base_instance_name        = "client-v8cgh"
        distribution_policy_zones = [
            "us-central1-a",
            "us-central1-b",
            "us-central1-c",
            "us-central1-f",
        ]
        fingerprint               = "L5QmVFosEd0="
        id                        = "projects/ucontex-app/regions/us-central1/instanceGroupManagers/client-v8cgh-mig"
        instance_group            = "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/instanceGroups/client-v8cgh-mig"
        name                      = "client-v8cgh-mig"
        project                   = "ucontex-app"
        region                    = "us-central1"
        self_link                 = "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/instanceGroupManagers/client-v8cgh-mig"
        target_pools              = [
            "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/targetPools/client-v8cgh",
        ]
        target_size               = 1
        wait_for_instances        = false

        timeouts {
            create = "5m"
            delete = "15m"
            update = "5m"
        }

        update_policy {
            instance_redistribution_type = "PROACTIVE"
            max_surge_fixed              = 4
            max_surge_percent            = 0
            max_unavailable_fixed        = 4
            max_unavailable_percent      = 0
            min_ready_sec                = 0
            minimal_action               = "REPLACE"
            type                         = "OPPORTUNISTIC"
        }

      ~ version {
          ~ instance_template = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/instanceTemplates/nomad-client-template-staging-20201102204716823800000002" -> (known after apply)
            name              = "client-v8cgh-mig-version-0"
        }
    }

  # module.server_instance_template.google_compute_instance_template.tpl must be replaced
+/- resource "google_compute_instance_template" "tpl" {
        can_ip_forward          = false
      ~ id                      = "projects/ucontex-app/global/instanceTemplates/nomad-server-template-staging-20201102204716810800000001" -> (known after apply)
        machine_type            = "n1-standard-1"
      - metadata                = {} -> null
      ~ metadata_fingerprint    = "8lD3JF2csPI=" -> (known after apply)
      ~ metadata_startup_script = <<~EOT # forces replacement
            #!/bin/bash
            
            set -xe
            
            PUBLIC_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/access-configs/0/external-ip -H "Metadata-Flavor:Google")
            PRIVATE_IP=$(curl -L http://metadata.google.internal/computeMetadata/v1/instance/network-interfaces/0/ip -H "Metadata-Flavor:Google")
            export VAULT_TOKEN=vault
            export VAULT_ADDR="http://localhost:8200"
            
            function configConsul() {
            	(
            		cat <<-EOF
            			datacenter = "us-central1"
            			data_dir   = "/opt/consul/data"
            			log_level  = "DEBUG"
            
            			bind_addr          = "0.0.0.0"
            			advertise_addr     = "$PRIVATE_IP"
            			advertise_addr_wan = "$PRIVATE_IP"
            
            			bootstrap_expect   = 1
            			client_addr = "0.0.0.0"
            			server      = true
            			ui          = true
            
            			retry_join = [
            			"provider=gce project_name=ucontex-app tag_value=autojoin"
            			]
            
            			raft_protocol = 3
            
            			autopilot {
            			cleanup_dead_servers      = true
            			last_contact_threshold    = "200ms"
            			max_trailing_logs         = 250
            			server_stabilization_time = "10s"
            			}
            
            			connect {
            			enabled = true
            			}
            
            			ports {}
            		EOF
            	) | sudo tee /etc/consul.d/consul.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=consul agent
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/consul agent -config-dir=/etc/consul.d
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/consul.service
            
            	sudo systemctl enable consul
            	sudo systemctl start consul
            }
            
            function configVault() {
            	(
            		cat <<-EOF
            			[Unit]
            			Description=vault
            			Requires=network-online.target
            			After=network-online.target
            
            			[Service]
            			Restart=on-failure
            			ExecStart=/usr/local/bin/vault server -dev -dev-listen-address="0.0.0.0:8200" -dev-root-token-id="vault"
            			ExecReload=/bin/kill -HUP $MAINPID
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/vault.service
            
            	sudo systemctl enable vault
            	sudo systemctl start vault
            
            	# vault policy write rabbit /vagrant/vault/rabbit-policy.hcl
            	# vault policy write nomad-server /vagrant/vault/nomad-server-policy.hcl
            	# vault write auth/token/roles/nomad-cluster @/vagrant/vault/nomad-cluster-role.json
            
            	vault_token=$(vault token create -policy nomad-server -period 72h -orphan -field=token)
            
            	# domain="mshome.net"
            	# vault secrets enable pki
            	# vault secrets tune -max-lease-ttl=87600h pki
            
            	# vault write -field=certificate pki/root/generate/internal common_name="$domain" ttl=87600h \
            	#     > /vagrant/vault/mshome.crt
            
            	# vault write pki/config/urls \
            	#     issuing_certificates="$VAULT_ADDR/v1/pki/ca" \
            	#     crl_distribution_points="$VAULT_ADDR/v1/pki/crl"
            
            	# vault write pki/roles/rabbit \
            	#     allowed_domains="$domain" \
            	#     allow_subdomains=true \
            	#     generate_lease=true \
            	#     max_ttl="720h"
            }
            
            function configNomad() {
            	(
            		cat <<-EOF
            			data_dir   = "/opt/nomad/data"
            			datacenter = "us-central1"
            			region     = "us-central1"
            
            			bind_addr = "0.0.0.0"
            			log_level = "DEBUG"
            
            			advertise {
            			http = "$PRIVATE_IP"
            			rpc  = "$PRIVATE_IP"
            			serf = "$PRIVATE_IP"
            			}
            
            			server {
            			enabled          = true
            			bootstrap_expect = "1"
            			}
            
            			client {
            			enabled       = true
            			network_speed = 10
            			}
            
            			consul {
            			address          = "127.0.0.1:8500"
            			auto_advertise   = true
            			server_auto_join = true
            			client_auto_join = true
            			}
            
            			vault {
            			enabled          = true
            			address          = "$VAULT_ADDR"
            			task_token_ttl   = "1h"
            			create_from_role = "nomad-cluster"
            			token            = "$vault_token"
            			}
          - 
            		EOF
            	) | sudo tee /etc/nomad.d/nomad.hcl
            
            	(
            		cat <<-EOF
            			[Unit]
            			Description=Nomad
            			Documentation=https://nomadproject.io/docs/
            			Wants=network-online.target
            			After=network-online.target
            
            			[Service]
            			ExecReload=/bin/kill -HUP $MAINPID
            			ExecStart=/usr/local/bin/nomad agent -config /etc/nomad.d
            			KillMode=process
            			KillSignal=SIGINT
            			LimitNOFILE=infinity
            			LimitNPROC=infinity
            			Restart=on-failure
            			RestartSec=2
            			StartLimitBurst=3
            			StartLimitIntervalSec=10
            			TasksMax=infinity
            
            			[Install]
            			WantedBy=multi-user.target
            		EOF
            	) | sudo tee /etc/systemd/system/nomad.service
            
            	sudo systemctl enable nomad
            	sudo systemctl start nomad
            }
            
          - function run() {
          - 	# configure consul server
          - 	configConsul
          + # configure consul server
          + configConsul
            
          - 	# # configure vault server
          - 	configVault
          + # # configure vault server
          + configVault
            
          - 	sleep 5
          + # configure nomad server
          + configNomad
            
          - 	# configure nomad server
          - 	configNomad
          - 
          - 	sleep 5
          - }
          - 
          - # run setup instructions
          - run
            sudo systemctl daemon-reload
        EOT
      ~ name                    = "nomad-server-template-staging-20201102204716810800000001" -> (known after apply)
        name_prefix             = "nomad-server-template-staging-"
        project                 = "ucontex-app"
        region                  = "us-central1"
      ~ self_link               = "https://www.googleapis.com/compute/beta/projects/ucontex-app/global/instanceTemplates/nomad-server-template-staging-20201102204716810800000001" -> (known after apply)
      ~ tags                    = [ # forces replacement
          + "allow-ssh",
            "autojoin",
        ]
      + tags_fingerprint        = (known after apply)

      ~ disk {
            auto_delete  = true
            boot         = true
          ~ device_name  = "persistent-disk-0" -> (known after apply)
            disk_size_gb = 50
            disk_type    = "pd-standard"
          ~ interface    = "SCSI" -> (known after apply)
          - labels       = {} -> null
          ~ mode         = "READ_WRITE" -> (known after apply)
          ~ source_image = "projects/ucontex-app/global/images/hashistack" -> "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/images/hashistack"
          ~ type         = "PERSISTENT" -> (known after apply)
        }

      ~ network_interface {
          ~ name               = "nic0" -> (known after apply)
            network            = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/networks/staging-v8cgh-network"
            subnetwork         = "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/subnetworks/staging-v8cgh-subnetwork-public"
          ~ subnetwork_project = "ucontex-app" -> (known after apply)

          ~ access_config {
              + nat_ip                 = (known after apply)
              ~ network_tier           = "PREMIUM" -> (known after apply)
              + public_ptr_domain_name = (known after apply)
            }
        }

      ~ scheduling {
            automatic_restart   = true
          ~ on_host_maintenance = "MIGRATE" -> (known after apply)
            preemptible         = false
        }

      ~ service_account {
            email  = "terraform@ucontex-app.iam.gserviceaccount.com"
          - scopes = [] -> null
        }
    }

  # module.server_mig.google_compute_region_instance_group_manager.mig will be updated in-place
  ~ resource "google_compute_region_instance_group_manager" "mig" {
        base_instance_name        = "server-v8cgh"
        distribution_policy_zones = [
            "us-central1-a",
            "us-central1-b",
            "us-central1-c",
            "us-central1-f",
        ]
        fingerprint               = "-gBg4rbAPc0="
        id                        = "projects/ucontex-app/regions/us-central1/instanceGroupManagers/server-v8cgh-mig"
        instance_group            = "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/instanceGroups/server-v8cgh-mig"
        name                      = "server-v8cgh-mig"
        project                   = "ucontex-app"
        region                    = "us-central1"
        self_link                 = "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/instanceGroupManagers/server-v8cgh-mig"
        target_pools              = [
            "https://www.googleapis.com/compute/v1/projects/ucontex-app/regions/us-central1/targetPools/server-v8cgh",
        ]
        target_size               = 1
        wait_for_instances        = false

        timeouts {
            create = "5m"
            delete = "15m"
            update = "5m"
        }

        update_policy {
            instance_redistribution_type = "PROACTIVE"
            max_surge_fixed              = 4
            max_surge_percent            = 0
            max_unavailable_fixed        = 4
            max_unavailable_percent      = 0
            min_ready_sec                = 0
            minimal_action               = "REPLACE"
            type                         = "OPPORTUNISTIC"
        }

      ~ version {
          ~ instance_template = "https://www.googleapis.com/compute/v1/projects/ucontex-app/global/instanceTemplates/nomad-server-template-staging-20201102204716810800000001" -> (known after apply)
            name              = "server-v8cgh-mig-version-0"
        }
    }

Plan: 3 to add, 3 to change, 2 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

```

</details>

*Pusher: @IkeChukwuanu, Action: `pull_request`, Working Directory: ``, Workflow: `Staging - Provision Infra`*